Teuskamerling/FMStwizy/blockset/rtw/STM32/src/Olimexino_STM32/timeout.c
/************************************************************************************//**
* \file         timeout.c
* \brief        Timer outputs (output compare) driver source file.
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*  Copyright 2019 (c)  by HAN Automotive   http://www.han.nl        All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* Permission is hereby granted, free of charge, to any person obtaining a copy of this 
* software and associated documentation files (the "Software"), to deal in the Software
* without restriction, including without limitation the rights to use, copy, modify, merge,
* publish, distribute, sublicense, and/or sell copies of the Software, and to permit
* persons to whom the Software is furnished to do so, subject to the following conditions:
*
* The above copyright notice and this permission notice shall be included in all copies or
* substantial portions of the Software.
*
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
* PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE
* FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR
* OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
* DEALINGS IN THE SOFTWARE.
* \endinternal
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "timeout.h"                                  /* Timer output driver           */
#include "os.h"                                       /* for operating system          */
#include "errorcodes.h"                               /* for error codes               */
#include "errorList.h"                                /* for error list                */
#include "stm32f10x.h"                                /* STM32 registers               */
#include "stm32f10x_conf.h"                           /* STM32 peripheral drivers      */


/****************************************************************************************
* Macro definitions
****************************************************************************************/
/** \brief timer interrupt priority */
#define TIMEOUT_NVIC_IRQ_PRIO            (configLIBRARY_KERNEL_INTERRUPT_PRIORITY)

/** \brief Sets the number of output capture channels for a timer module. This is
 *         hardware defined.
 */
#define TIMEOUT_MAX_CHANNELS_PER_MODULE  (4)

/** \brief Determines the number of counts for the free running counter. */
#define TIMEOUT_PERIOD_COUNTS            (65536)

/** \brief Macro for easy access to the maximum number of supported timer modules. */
#define TIMEOUT_MODULES_MAX              (sizeof(moduleMapping)/sizeof(moduleMapping[0]))


/****************************************************************************************
* Type definitions
****************************************************************************************/
/**< \brief Structure type with module mapping information. */
typedef struct
{
  TIM_TypeDef * timer_peripheral;
  uint32_t timer_peripheral_clk;
  uint8_t timer_apb_number;
  uint32_t timer_remap_cfg;
  uint8_t timer_nvic_channel;
} tTimeoutModuleMapping;

/**< \brief Structure type with pin mapping information. */
typedef struct
{
  uint8_t peripheral_clk;
  GPIO_TypeDef* port;
  uint16_t pin;
  uint8_t module_idx;
  uint8_t channel_idx;
  uint16_t compare_irq_flg;
  uint16_t polarity_bit;
} tTimeoutPinMapping;


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static void TimeoutOverflowInterrupt(uint8_t module_id);
static void TimeoutCompareInterrupt(uint8_t pin_id);
static void TimeoutClearITPendingBit(TIM_TypeDef* TIMx, uint16_t TIM_IT);


/****************************************************************************************
* Constant data declarations
****************************************************************************************/
/** \brief Array with all configuration parameters of a timer module. note that
 *         TIM2-7 and TIM12-14 have a max input clock frequency of 84 Mhz as opposed
 *         to 168 MHz so these modules need an extra prescale divider.
 */
const static tTimeoutModuleMapping moduleMapping[] =
{
  { TIM1, RCC_APB2Periph_TIM1, 2, 0                   , TIM1_CC_IRQn },
  { TIM2, RCC_APB1Periph_TIM2, 1, 0                   , TIM2_IRQn    },
  { TIM3, RCC_APB1Periph_TIM3, 1, GPIO_FullRemap_TIM3 , TIM3_IRQn    },
  { TIM4, RCC_APB1Periph_TIM4, 1, 0                   , TIM4_IRQn    }
};

/** \brief Array with all configuration parameters of an output capture pin. */
const static tTimeoutPinMapping pinMapping[] =
{
  { RCC_APB2Periph_GPIOA, GPIOA, GPIO_Pin_8,  TIMEOUT_MODULE_TIM1, 0, TIM_IT_CC1, TIM_CCER_CC1P }, /* idx 0:  TIMEOUT_TIM1_PIN_PA8   */
  { RCC_APB2Periph_GPIOA, GPIOA, GPIO_Pin_9,  TIMEOUT_MODULE_TIM1, 1, TIM_IT_CC2, TIM_CCER_CC2P }, /* idx 1:  TIMEOUT_TIM1_PIN_PA9   */
  { RCC_APB2Periph_GPIOA, GPIOA, GPIO_Pin_10, TIMEOUT_MODULE_TIM1, 2, TIM_IT_CC3, TIM_CCER_CC3P }, /* idx 2:  TIMEOUT_TIM1_PIN_PA10  */
  { RCC_APB2Periph_GPIOA, GPIOA, GPIO_Pin_0,  TIMEOUT_MODULE_TIM2, 0, TIM_IT_CC1, TIM_CCER_CC1P }, /* idx 4:  TIMEOUT_TIM2_PIN_PA0   */
  { RCC_APB2Periph_GPIOA, GPIOA, GPIO_Pin_1,  TIMEOUT_MODULE_TIM2, 1, TIM_IT_CC2, TIM_CCER_CC2P }, /* idx 5:  TIMEOUT_TIM2_PIN_PA1   */
  { RCC_APB2Periph_GPIOA, GPIOA, GPIO_Pin_2,  TIMEOUT_MODULE_TIM2, 2, TIM_IT_CC3, TIM_CCER_CC3P }, /* idx 6:  TIMEOUT_TIM2_PIN_PA2   */
  { RCC_APB2Periph_GPIOA, GPIOA, GPIO_Pin_3,  TIMEOUT_MODULE_TIM2, 3, TIM_IT_CC4, TIM_CCER_CC4P }, /* idx 7:  TIMEOUT_TIM2_PIN_PA3   */
  { RCC_APB2Periph_GPIOC, GPIOC, GPIO_Pin_6,  TIMEOUT_MODULE_TIM3, 0, TIM_IT_CC1, TIM_CCER_CC1P }, /* idx 8:  TIMEOUT_TIM3_PIN_PC6   */
  { RCC_APB2Periph_GPIOC, GPIOC, GPIO_Pin_7,  TIMEOUT_MODULE_TIM3, 1, TIM_IT_CC2, TIM_CCER_CC2P }, /* idx 9:  TIMEOUT_TIM3_PIN_PC7   */
  { RCC_APB2Periph_GPIOC, GPIOC, GPIO_Pin_8,  TIMEOUT_MODULE_TIM3, 2, TIM_IT_CC3, TIM_CCER_CC3P }, /* idx 10: TIMEOUT_TIM3_PIN_PC8   */
  { RCC_APB2Periph_GPIOB, GPIOB, GPIO_Pin_6,  TIMEOUT_MODULE_TIM4, 0, TIM_IT_CC1, TIM_CCER_CC1P }, /* idx 12: TIMEOUT_TIM4_PIN_PB6   */
  { RCC_APB2Periph_GPIOB, GPIOB, GPIO_Pin_7,  TIMEOUT_MODULE_TIM4, 1, TIM_IT_CC2, TIM_CCER_CC2P }, /* idx 13: TIMEOUT_TIM4_PIN_PB7   */
  { RCC_APB2Periph_GPIOB, GPIOB, GPIO_Pin_8,  TIMEOUT_MODULE_TIM4, 2, TIM_IT_CC3, TIM_CCER_CC3P }, /* idx 14: TIMEOUT_TIM4_PIN_PB8   */
  { RCC_APB2Periph_GPIOB, GPIOB, GPIO_Pin_9,  TIMEOUT_MODULE_TIM4, 3, TIM_IT_CC4, TIM_CCER_CC4P }  /* idx 15: TIMEOUT_TIM4_PIN_PB9   */
};


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief Function pointers for the user specified free running counter overflow
 *         detected interrupt handler. 
 */
static tTimeoutCallbackOverflow counterOverflowDetected[TIMEOUT_MODULES_MAX];

/** \brief Function pointers for the user specified output compare event detected
 *         interrupt handler. 
 */
static tTimeoutCallbackCompareEvent compareEventDetected[TIMEOUT_MODULES_MAX][TIMEOUT_MAX_CHANNELS_PER_MODULE];

