Teuskamerling/FMStwizy/blockset/rtw/STM32/src/Olimexino_STM32/timeout.c
/** \brief Holds information about if a timer module's pin was already configured. */
static volatile uint8_t pin_configured[TIMEOUT_MODULES_MAX][TIMEOUT_MAX_CHANNELS_PER_MODULE];

/** \brief Holds information about if a timer module was already configured. */
static volatile uint8_t module_initialized[TIMEOUT_MODULES_MAX] = { FALSE, FALSE, FALSE, FALSE };

/** \brief Holds a timestamp of the free running counter from the time that the last
 *         output compare event was detected.
 */
static volatile uint16_t lastEventCounter[TIMEOUT_MODULES_MAX][TIMEOUT_MAX_CHANNELS_PER_MODULE];


/************************************************************************************//**
** \brief     Initializes the timer outputs driver for a specific timer module.
** \param     module_id Timer module identifier.
** \param     frequnecy Frequency in Hz for the free running counter.
** \return    none.
**
****************************************************************************************/
void TimeoutInitModule(uint8_t module_id, uint32_t frequency)
{
  NVIC_InitTypeDef  NVIC_InitStructure;
  TIM_TimeBaseInitTypeDef tim_base;
  uint16_t prescaler;
  uint8_t i;

  /* make sure the id is valid before using it as an array indexer */
  if (!(module_id < sizeof(moduleMapping)/sizeof(moduleMapping[0])))
  {
    ErrCodesSetError(ER_CODE_TIMEOUT_INVALID_MODULE, ER_PARAM_SEVERITY_CRITICAL, TRUE);
  }
  /* only initialize if not yet initialized */
  if (module_initialized[module_id] == TRUE)
  {
    /* nothing left to do because this module is already initialized */
    return;
  }
  /* reset the free running counter overflow event callback */
  counterOverflowDetected[module_id] = NULL;
  /* reset the output compare event callback and the channel/pin initialization flag. */
  for (i=0; i<TIMEOUT_MAX_CHANNELS_PER_MODULE; i++)
  {
    lastEventCounter[module_id][i] = 0;
    compareEventDetected[module_id][i] = NULL;
    pin_configured[module_id][i] = FALSE;
  }
  /* turn on the timer clock */
  if (moduleMapping[module_id].timer_apb_number == 1)
  {
    RCC_APB1PeriphClockCmd(moduleMapping[module_id].timer_peripheral_clk, ENABLE);
  }
  else
  {
    RCC_APB2PeriphClockCmd(moduleMapping[module_id].timer_peripheral_clk, ENABLE);
  }
  /* enable the timer module global interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = moduleMapping[module_id].timer_nvic_channel;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = TIMEOUT_NVIC_IRQ_PRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  /* timer 1 is special as it has separate IRQ channels */
  if (moduleMapping[module_id].timer_peripheral == TIM1)
  {
    NVIC_InitStructure.NVIC_IRQChannel = TIM1_UP_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = TIMEOUT_NVIC_IRQ_PRIO;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
  }
  /* compute the prescaler value */
  prescaler = (SystemCoreClock / frequency) - 1;
  /* configure the timer module and enable it */
  tim_base.TIM_Period = (TIMEOUT_PERIOD_COUNTS - 1);
  tim_base.TIM_Prescaler = prescaler;
  tim_base.TIM_ClockDivision = 0;
  tim_base.TIM_CounterMode = TIM_CounterMode_Up;
  tim_base.TIM_RepetitionCounter = 0;
  TIM_TimeBaseInit(moduleMapping[module_id].timer_peripheral, &tim_base);
  TIM_ARRPreloadConfig(moduleMapping[module_id].timer_peripheral, DISABLE);
  TIM_SetCounter(moduleMapping[module_id].timer_peripheral, 0);
  TIM_Cmd(moduleMapping[module_id].timer_peripheral, ENABLE);
  /* turn on the outputs */
  TIM_CtrlPWMOutputs(moduleMapping[module_id].timer_peripheral, ENABLE);
  /* enable the counter overflow interrupt request for the module */
  TIM_ITConfig(moduleMapping[module_id].timer_peripheral, TIM_IT_Update, ENABLE);
  /* set module to initialized */
  module_initialized[module_id] = TRUE;
} /*** end of TimeoutInit ***/


/************************************************************************************//**
** \brief     Configures a timer module channel pin for output compare operation, if not
**            already done, and schedule the next output compare event.
** \param     pin_id Pin identifier.
** \param     eventCounter Free running counter value at which the event should be 
**                         generated.
** \param     action The action that should be taken when the event occurred.
** \return    none.
**
****************************************************************************************/
void TimeoutScheduleCompareEvent(uint8_t pin_id, uint16_t eventCounter, tTimeoutAction action)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  TIM_OCInitTypeDef TIM_OCInitStructure;


  /* make sure the id is valid before using it as an array indexer */
  if (!(pin_id < sizeof(pinMapping)/sizeof(pinMapping[0])))
  {
    ErrCodesSetError(ER_CODE_TIMEOUT_INVALID_PIN, ER_PARAM_SEVERITY_CRITICAL, TRUE);
  }

  /* do one-time pin configuration */
  if (pin_configured[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx] == FALSE)
  {
    /* enable the port's peripheral clock */
    RCC_APB2PeriphClockCmd(pinMapping[pin_id].peripheral_clk | RCC_APB2Periph_AFIO, ENABLE);
    /* initialize the GPIO pin */
    GPIO_InitStructure.GPIO_Pin =  pinMapping[pin_id].pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(pinMapping[pin_id].port, &GPIO_InitStructure);
    /* map port pins to timer module. note that this must be done after GPIO init */
    if (moduleMapping[pinMapping[pin_id].module_idx].timer_remap_cfg != 0)
    {
      GPIO_PinRemapConfig(moduleMapping[pinMapping[pin_id].module_idx].timer_remap_cfg, ENABLE);
    }
    /* flag pin as configured */
    pin_configured[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx] = TRUE;
  }
  /* output compare default values configuration */
  TIM_OCStructInit(&TIM_OCInitStructure);
  /* configure output compare */
  TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
  TIM_OCInitStructure.TIM_Pulse = eventCounter;
  if (action == INVERT)
  {
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Toggle;
  }
  else if (action == SETLOW)
  {
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Inactive;
  }
  else if (action == SETHIGH)
  {
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Active;
  }
  else
  {
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Timing;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Disable;
  }
  /* store the desired output compare configuration */
  if (pinMapping[pin_id].channel_idx == 0)
  {
    TIM_OC1Init(moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral, &TIM_OCInitStructure);
    TIM_OC1PreloadConfig(moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral, TIM_OCPreload_Disable);
  }
  else if (pinMapping[pin_id].channel_idx == 1)
  {
    TIM_OC2Init(moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral, &TIM_OCInitStructure);
    TIM_OC2PreloadConfig(moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral, TIM_OCPreload_Disable);
  }
  else if (pinMapping[pin_id].channel_idx == 2)
  {
    TIM_OC3Init(moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral, &TIM_OCInitStructure);
    TIM_OC3PreloadConfig(moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral, TIM_OCPreload_Disable);
  }
  else if (pinMapping[pin_id].channel_idx == 3)
  {
    TIM_OC4Init(moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral, &TIM_OCInitStructure);
    TIM_OC4PreloadConfig(moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral, TIM_OCPreload_Disable);
  }
  /* enable the output compare interrupt request for the channel */
  TIM_ITConfig(moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral, pinMapping[pin_id].compare_irq_flg, ENABLE);
} /*** end of TimeoutScheduleCompareEvent ***/


/************************************************************************************//**
** \brief     Obtains the current value of the timer module's free running counter.
** \param     module_id Timer module identifier.
** \return    Free running counter value.
**
****************************************************************************************/
uint16_t TimeoutGetFreeRunningCounter(uint8_t module_id)
{
  /* make sure the id is valid before using it as an array indexer */
  if (!(module_id < sizeof(moduleMapping)/sizeof(moduleMapping[0])))
  {
    ErrCodesSetError(ER_CODE_TIMEOUT_INVALID_MODULE, ER_PARAM_SEVERITY_CRITICAL, TRUE);
  }

