Teuskamerling/FMStwizy/blockset/rtw/STM32/src/Olimexino_STM32/timeout.c
  /* only access timer module if it was initialized */
  if (module_initialized[module_id] != TRUE)
  {
    return 0;
  }

  /* read out the value of the counter */
  return TIM_GetCounter(moduleMapping[module_id].timer_peripheral);
} /*** end of TimeoutGetFreeRunningCounter ***/


/************************************************************************************//**
** \brief     Resets the value of the timer module's free running counter to 0.
** \param     module_id Timer module identifier.
** \return    none.
**
****************************************************************************************/
void TimeoutResetFreeRunningCounter(uint8_t module_id)
{
  /* make sure the id is valid before using it as an array indexer */
  if (!(module_id < sizeof(moduleMapping)/sizeof(moduleMapping[0])))
  {
    ErrCodesSetError(ER_CODE_TIMEOUT_INVALID_MODULE, ER_PARAM_SEVERITY_CRITICAL, TRUE);
  }

  /* only access timer module if it was initialized */
  if (module_initialized[module_id] == TRUE)
  {
    /* set the free running counter back to zero */
    TIM_SetCounter(moduleMapping[module_id].timer_peripheral, 0);
  }
} /*** end of TimeoutResetFreeRunningCounter ***/


/************************************************************************************//**
** \brief     Obtains the counter value of when the last output compare event occurred.
** \param     pin_id Pin identifier.
** \return    Counter value of when the last output compare event occurred.
**
****************************************************************************************/
uint16_t TimeoutGetLastEventCounter(uint8_t pin_id)
{
  /* make sure the id is valid before using it as an array indexer */
  if (!(pin_id < sizeof(pinMapping)/sizeof(pinMapping[0])))
  {
    ErrCodesSetError(ER_CODE_TIMEOUT_INVALID_PIN, ER_PARAM_SEVERITY_CRITICAL, TRUE);
  }

  /* read out the counter that golds the timestamp of when the last output compare
   * occurred.
   */
  return lastEventCounter[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx];
} /*** end of TimeoutGetLastEventCounter ***/


/************************************************************************************//**
** \brief     Registers the callback handler that gets called by the driver each time
**            the 16-bit free running counter for the module overflows.
** \param     module_id Timer module identifier.
** \param     callbackPtr Function pointer to the callback.
** \return    none.
**
****************************************************************************************/
void TimeoutRegisterOverflowCallback(uint8_t module_id, tTimeoutCallbackOverflow callbackPtr)
{
  /* make sure the id is valid before using it as an array indexer */
  if (!(module_id < sizeof(moduleMapping)/sizeof(moduleMapping[0])))
  {
    ErrCodesSetError(ER_CODE_TIMEOUT_INVALID_MODULE, ER_PARAM_SEVERITY_CRITICAL, TRUE);
  }
  /* store the function pointer */
  counterOverflowDetected[module_id] = callbackPtr;
} /*** end of TimeoutRegisterOverflowCallback ***/


/************************************************************************************//**
** \brief     Registers the callback handler that gets called by the driver each time
**            the channel's output compare event occurred.
** \param     pin_id Pin identifier.
** \param     callbackPtr Function pointer to the callback.
** \return    none.
**
****************************************************************************************/
void TimeoutRegisterCompareEventCallback(uint8_t pin_id, tTimeoutCallbackCompareEvent callbackPtr)
{
  /* make sure the id is valid before using it as an array indexer */
  if (!(pin_id < sizeof(pinMapping)/sizeof(pinMapping[0])))
  {
    ErrCodesSetError(ER_CODE_TIMEOUT_INVALID_PIN, ER_PARAM_SEVERITY_CRITICAL, TRUE);
  }
  /* store the function pointer */
  compareEventDetected[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx] = callbackPtr;
} /*** end of TimeoutRegisterCompareEventCallback ***/


/************************************************************************************//**
** \brief     Similar to the TIM_ClearITPendingBit function in the peripheral driver
**            library with the only modification that is uses bit-banding to clear the
**            interrupt flags. The problem with the original function is that the
**            bit clearing is not done atomically and therefore it can happen in rare
**            cases that during a flag clear operation of the updated event, an input
**            capture flag is set and unfortunately cleared as well. This would still
**            cause in interrupt but without the correct event flag set.
** \param     TIMx: where x can be 1 to 17 to select the TIM peripheral.
** \param     TIM_IT: specifies the pending bit to clear.
** \return    none.
**
****************************************************************************************/
static void TimeoutClearITPendingBit(TIM_TypeDef* TIMx, uint16_t TIM_IT)
{
  /* macro to convert PERI address to the bit-band address. it takes the base register
   * address as 'a' and the bit-number as 'b'. note that the bit-number starts at 0,
   * so it is not the same as the bit-mask.
   */
  #define BITBAND_PERI(a,b) ((PERIPH_BB_BASE + (a-PERIPH_BASE)*32 + (b*4)))
  /* macro to convert a bit-mask to a bit-number */
  #define BITNR(x) (x&0x1?0:x&0x2?1:x&0x4?2:x&0x8?3: \
                    x&0x10?4:x&0x20?5:x&0x40?6:x&0x80?7: \
                    x&0x100?8:x&0x200?9:x&0x400?10:x&0x800?11: \
                    x&0x1000?12:x&0x2000?13:x&0x4000?14:x&0x8000?15: \
                    x&0x10000?16:x&0x20000?17:x&0x40000?18:x&0x80000?19: \
                    x&0x100000?20:x&0x200000?21:x&0x400000?22:x&0x800000?23: \
                    x&0x1000000?24:x&0x2000000?25:x&0x4000000?26:x&0x8000000?27: \
                    x&0x10000000?28:x&0x20000000?29:x&0x40000000?30:x&0x80000000?31:32)
  /* macro that can be used to directly write a 1 or 0 to a bit in the bit-banding
   * address space.
   */
  #define REGBIT(regaddr, bitmask) (*(uint32_t volatile*)(BITBAND_PERI((uint32_t)regaddr,BITNR(bitmask))))

  /* clear the IT pending bit using bit-banding */
  REGBIT(&(TIMx->SR), TIM_IT) = 0;
} /*** end of TimeoutClearITPendingBit ***/


/************************************************************************************//**
** \brief     Generic interrupt service routine handler for the free running counter
**            overflow interrupt event.
** \param     module_id Timer module identifier.
** \return    none.
**
****************************************************************************************/
static void TimeoutOverflowInterrupt(uint8_t module_id)
{
  /* this ISR is shared with others, so make sure this module is configured before
   * processing this interrupt.
   */
  if (module_initialized[module_id] == FALSE)
  {
    /* interrupt not for us */
    return;
  }

  /* clear timer counter overflow event flag for the channel of the event */
  TimeoutClearITPendingBit(moduleMapping[module_id].timer_peripheral, TIM_IT_Update);
  /* invoke callback to pass on the counter overflow event */
  if (counterOverflowDetected[module_id] != NULL)
  {
    counterOverflowDetected[module_id]();
  }
} /*** end of TimeoutOverflowInterrupt ***/


/************************************************************************************//**
** \brief     Generic interrupt service routine handler for the output compare interrupt
**            event.
** \param     pin_id Pin identifier.
** \return    none.
**
****************************************************************************************/
static void TimeoutCompareInterrupt(uint8_t pin_id)
{
  uint16_t eventTimestamp;

