Teuskamerling/FMStwizy/blockset/rtw/STM32/src/Olimexino_STM32/timeout.c
  /* this ISR is shared with others, so make sure this pin is configured before
   * processing this interrupt.
   */
  if (pin_configured[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx] == FALSE)
  {
    /* interrupt not for us */
    return;
  }
  /* make sure to read the configured event counter timestamp from the correct channel */
  if (pinMapping[pin_id].channel_idx == 0)
  {
    eventTimestamp = moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral->CCR1;
  }
  else if (pinMapping[pin_id].channel_idx == 1)
  {
    eventTimestamp = moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral->CCR2;
  }
  else if (pinMapping[pin_id].channel_idx == 2)
  {
    eventTimestamp = moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral->CCR3;
  }
  else if (pinMapping[pin_id].channel_idx == 3)
  {
    eventTimestamp = moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral->CCR4;
  }
  /* clear timer module's output compare flag for the channel of the event */
  TimeoutClearITPendingBit(moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral, pinMapping[pin_id].compare_irq_flg);
  /* store compare counter into last compare event counter */
  lastEventCounter[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx] = eventTimestamp;
  /* invoke callback to pass on compare event */
  if (compareEventDetected[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx] != NULL)
  {
    compareEventDetected[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx]();
  }
} /*** end of TimeoutCompareInterrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer update channel 1.
** \return    none.
**
****************************************************************************************/
void Timeout1UpdateInterrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM1, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM1);
  }
} /*** end of Timeout1UpdateInterrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer capture channel 1.
** \return    none.
**
****************************************************************************************/
void Timeout1CaptureInterrupt(void)
{
  /* --------------- was it an output compare event for the 1st channel? ------------- */
  if(TIM_GetITStatus(TIM1, TIM_IT_CC1) == SET)
  {
    /* process the event */
    TimeoutCompareInterrupt(TIMEOUT_TIM1_PIN_PA8);
  }
  /* --------------- was it an output compare event for the 2nd channel? ------------- */
  else if(TIM_GetITStatus(TIM1, TIM_IT_CC2) == SET)
  {
    /* process the event */
    TimeoutCompareInterrupt(TIMEOUT_TIM1_PIN_PA9);
  }
  /* --------------- was it an output compare event for the 3rd channel? ------------- */
  else if(TIM_GetITStatus(TIM1, TIM_IT_CC3) == SET)
  {
    /* process the event */
    TimeoutCompareInterrupt(TIMEOUT_TIM1_PIN_PA10);
  }
} /*** end of Timeout1CaptureInterrupt ***/



/************************************************************************************//**
** \brief     Interrupt service routine for timer channel 2.
** \return    none.
**
****************************************************************************************/
void Timeout2Interrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM2);
  }
  else
  {
    /* --------------- was it an output compare event for the 1st channel? ----------- */
    if(TIM_GetITStatus(TIM2, TIM_IT_CC1) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM2_PIN_PA0);
    }
    /* --------------- was it an output compare event for the 2nd channel? ----------- */
    else if(TIM_GetITStatus(TIM2, TIM_IT_CC2) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM2_PIN_PA1);
    }
    /* --------------- was it an output compare event for the 3rd channel? ----------- */
    else if(TIM_GetITStatus(TIM2, TIM_IT_CC3) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM2_PIN_PA2);
    }
    /* --------------- was it an output compare event for the 4th channel? ----------- */
    else if(TIM_GetITStatus(TIM2, TIM_IT_CC4) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM2_PIN_PA3);
    }
  }
} /*** end of Timeout2Interrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer channel 3.
** \return    none.
**
****************************************************************************************/
void Timeout3Interrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM3, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM3);
  }
  else
  {
    /* --------------- was it an output compare event for the 1st channel? ------------ */
    if(TIM_GetITStatus(TIM3, TIM_IT_CC1) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM3_PIN_PC6);
    }
    /* --------------- was it an output compare event for the 2nd channel? ------------ */
    else if(TIM_GetITStatus(TIM3, TIM_IT_CC2) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM3_PIN_PC7);
    }
    /* --------------- was it an output compare event for the 3rd channel? ------------ */
    else if(TIM_GetITStatus(TIM3, TIM_IT_CC3) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM3_PIN_PC8);
    }
  }
} /*** end of Timeout3Interrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer channel 4.
** \return    none.
**
****************************************************************************************/
void Timeout4Interrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM4, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM4);
  }
  else
  {
    /* --------------- was it an output compare event for the 1st channel? -------------- */
    if(TIM_GetITStatus(TIM4, TIM_IT_CC1) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM4_PIN_PB6);
    }
    /* --------------- was it an output compare event for the 2nd channel? -------------- */
    else if(TIM_GetITStatus(TIM4, TIM_IT_CC2) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM4_PIN_PB7);
    }
    /* --------------- was it an output compare event for the 3rd channel? -------------- */
    else if(TIM_GetITStatus(TIM4, TIM_IT_CC3) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM4_PIN_PB8);
    }
    /* --------------- was it an output compare event for the 4th channel? -------------- */
    else if(TIM_GetITStatus(TIM4, TIM_IT_CC4) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM4_PIN_PB9);
    }
  }
} /*** end of Timeout4Interrupt ***/


/************************************ end of timeout.c *********************************/


